Repository: aayushamarne/si-grapemaster
Catalog: lib/l10n/intl_*.arb
Languages: hi, mr

# appTitle
source: GrapeMaster
hi: ग्रेपमास्टर
mr: ग्रेपमास्टर

source: Farming Assistant
hi: खेती सहायक
mr: शेत सहाय्यक

# assistantWelcome
source: Hello! 👋 I'm your farming assistant. Ask me anything about: • Grape farming & diseases • Pest management • Irrigation tips • Fertilizer recommendations • Weather-based advice How can I help you today?
hi: नमस्ते! 👋 मैं आपका खेती सहायक हूँ। मुझसे नीचे के बारे में कुछ भी पूछें: • अंगूर की खेती और रोग • कीट प्रबंधन • सिंचाई के सुझाव • उर्वरक की सलाह • मौसम-आधारित सुझाव मैं आपकी कैसे मदद कर सकता हूँ?
mr: नमस्कार! 👋 मी तुमचा शेत सहाय्यक आहे. मला खालील विषयांबद्दल काहीही विचारा: • द्राक्ष लागवड आणि रोग • कीटक व्यवस्थापन • सिंचन सूचना • खत शिफारसी • हवामान-आधारित सल्ला मी तुम्हाला कशी मदत करू शकतो?

source: Ask about farming...
hi: खेती के बारे में पूछें...
mr: शेतबद्दल विचारा...

# assistantTyping
source: Assistant is typing...
hi: सहायक टाइप कर रहा है...
mr: सहाय्यक टाइप करत आहे...

source: Chat settings
hi: चैट सेटिंग्स
mr: चॅट सेटिंग्ज

# clearChatTooltip
source: Clear chat
hi: चैट साफ़ करें
mr: चॅट साफ करा

# chatSettingsSaved
source: Chat settings saved and validated.
hi: चैट सेटिंग्स सुरक्षित और सत्यापित हो गईं।
mr: चॅट सेटिंग्ज जतन आणि समर्थनीय आहेत.

# chatSettingsSavedFailed
source: Chat settings saved (validation failed)
hi: चैट सेटिंग्स सुरक्षित की गईं (सत्यापन विफल)
mr: चॅट सेटिंग्ज जतन झाल्या (सत्यापन अयशस्वी)

# groqInvalidApiKeySnack
source: Groq returned 401 — invalid API key.
hi: Groq ने 401 लौटाया — अमान्य API कुंजी।
mr: Groq ने 401 परत केले — अमान्य API की.

# voiceComingSoon
source: Voice input coming soon!
hi: वॉइस इनपुट जल्द आ रहा है!
mr: व्हॉइस इनपुट लवकरच येणार!

# chatCleared
source: Chat cleared! How can I help you?
hi: चैट साफ़ कर दी गई! मैं आपकी कैसे मदद करूं?
mr: चॅट स्वच्छ केली! मी तुमची कशी मदत करू शकतो?

# disease_powdery_mildew
source: Powdery Mildew
hi: धूल जैसा फफूंदी (Powdery Mildew)
mr: पावरी मिल्ड्यू (Powdery Mildew)

# disease_downy_mildew
source: Downy Mildew
hi: डाउनी मिल्ड्यू (Downy Mildew)
mr: डाउनी मिल्ड्यू (Downy Mildew)

# disease_black_rot
source: Black Rot
hi: ब्लैक रॉट (Black Rot)
mr: ब्लॅक रॉट (Black Rot)

# disease_botrytis_bunch_rot
source: Botrytis (Grey Mold)
hi: बोट्राइटिस (ग्रे मोल्ड)
mr: बोट्राइटिस (ग्रे मोल्ड)

# disease_anthracnose
source: Anthracnose
hi: एंथ्राक्नोज़ (Anthracnose)
mr: एंथ्रॅक्नोज (Anthracnose)

# disease_leaf_spot
source: Leaf Spot
hi: लीफ स्पॉट (Leaf Spot)
mr: लीफ स्पॉट (Leaf Spot)
